package com.example.qurankareem.data

import com.example.qurankareem.R

sealed class ExploreData(val title: String, val icon: Int) {
    object Praying : ExploreData("الصلاة", R.drawable.download)
    object Fasting : ExploreData("الصوم", R.drawable.download__3_)
    object Zakah: ExploreData("الزكاة",R.drawable.zakahlogo)
    object Hajj: ExploreData("الحج",R.drawable.hajjlogo)

    data class DetailSalahData(val title: String, val description: String)
    data class DetailSoumData(val title: String, val description: String)
    data class DetailZakahData(val title: String, val description: String)
    data class DetailHajjData(val title: String, val description: String)
}



val detailSalahData = listOf(
    ExploreData.DetailSalahData(
        "الصلاة بشكلٍ عام",
        description = "كان -عليه الصلاة والسّلام- إذا أراد الصلاة تطهّر، وستر العورة، واستقبل القبلة، واستحضر قلبه مخلصاً لله بخشوعٍ. ثمّ كان يكبّر رافعاً يديه بمحاذاة منكبيه. ثمّ يشرع في قراءة الفاتحة في كلّ ركعةٍ، وما تيسّر من القرآن في الركعتين الأوليين من الصلاة. ثمّ يكبّر رافعاً يديه بمحاذاة منكبيه، ويركع مطمئناً في ركوعه فينحني بالقدر الذي تلامس فيه يداه ركبتيه، ويعظّم الله -سبحانه- في ركوعه، بقول: \"سبحان ربّي العظيم\". ثمّ يرفع من الركوع ويطمئن قائلاً: \"سمع الله لمن حمده، ربّنا ولك الحمد\". ثم يكبّر ثمّ يهوي إلى الأرض ساجداً، قائلاً في سجوده: \"سبحان ربّي الأعلى\". ثمّ يكبّر ويرفع رأسه من السجود حتّى يستوي جالساً، مفترشاً رجله اليسرى، وناصباً اليمنى، جاعلاً أصابعها باتجاه القبلة، ويقول: \"رب اغفر لي، رب اغفر لي\". ثمّ يكبّر ويسجد السجدة الثانية كالأولى. ثمّ يكبر ويستوي جالساً على رجله اليسرى. ثمّ يقوم للركعة الثانية معتمداً بيديه على الأرض، ويفعل مثل فعله في الركعة الأولى. ثمّ يجلس للتشهّد الأول، ويقرأ التشهّد متبوعاً بالصلاة على النبيّ إن كانت الصلاة ثنائيّةً، وأمّا إن كانت الصلاة ثلاثيّةً أو رباعيّةً؛ فيقرأ المصلّي في الركعة الثانية بعد الرفع من السجدة الثانية التشهّد وحده دون الصلاة على النبيّ، وفي الركعة الأخيرة يقرأ التشهّد والصّلاة على النبيّ، ويسلّم عن يمينه ثمّ عن شماله. يفعل في الركعتين الثالثة والرابعة، ما فعل بما قبلهما، ويقرأ فيهما سورة الفاتحة فقط، ويكون جلوسه الأخير بنصب الرجل اليمنى وفرش الرجل اليسرى، جاعلاً مقعدته على الأرض."
    ),

    ExploreData.DetailSalahData(
        title = "أركان الصلاة",
        description = "للصلاة أركان لا تتمّ الصلاة إلّا بها، ولا تصحّ دونها، والركن هو ما يتوقّف عليه وجود الشيء، ويكون داخلاً في ماهيّته، وبهذا يفترق عن الشرط؛ إذ إنّ الشرط وإن كان يتوقّف على وجوده وجود الحكم، إلّا أنّه خارجٌ عن ماهيّة الشيء وحقيقته؛ فالوضوء شرطٌ لصحة الصلاة لكنّه ليس جزءاً من حقيقتها، بل هو سابقٌ لها، بينما الركوع ركنٌ في الصلاة، وداخلٌ في حقيقتها. وقد بيّن الفقهاء أركان الصلاة، واتّفقوا بالمجمل على أركانها، وتعدّدت آرائهم في بعض تفاصيلها، وبيانها فيما يأتي: النيّة: وهي ركنٌ من أركان الصلاة عند الشافعيّة وبعض المالكيّة، وشرطٌ من شروطها عند الحنفيّة والحنابلة والراجح في مذهب المالكيّة، وتفيد النيّة عقد القلب وعزمه على أداء العبادة خالصةً لله -تعالى-، وتجب مع بداية الصلاة، والغاية من وجوب النيّة في الصلاة؛ تمييز العبادات عن العادات، وتحقيق تمام الإخلاص لله -تعالى-. تكبيرة الإحرام: فمن الأركان التكبير قائماً؛ أي أن يقول المصلّي: \"الله أكبر\"، وهو قائمٌ إن كان قادراً على القيام؛ لأنّ القيام ركنٌ، ويقولها بالعربيّة، وهي ركنٌ لا تصحّ الصلاة دونه، وإن عُجز عن النطق بالتكبير، كمن كان أخرساً فإنّه يسقط عنه، والدليل على كون التكبير ركناً؛ قول النبيّ -صلّى الله عليه وسلّم-: (إذَا قُمْتَ إلى الصَّلَاةِ فَكَبِّرْ). القيام: حيث يجب على المسلم أداء الصلاة قائماً في حال كان قادراً على القيام، لقول الرسول -عليه الصلاة والسلام- لعمران بن حصين: (صَلِّ قَائِمًا). القراءة: وقراءة الفاتحة ركنٌ في الصلاة عند جمهور الفقهاء في كلّ ركعةٍ، واستدلّوا على ركنيّتها بقوله -صلّى الله عليه وسلّم-: (لا صَلاةَ لِمَن لَمْ يَقْرَأْ بفاتِحَةِ الكِتابِ)، ولم يقيّد الحنفية القراءة بالفاتحة، وقالوا بقراءة آية من القرآن، استدلالاً بقول الله -تعالى-: (فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ). الركوع والطمأنينة فيه: ويقتضي الركوع أن ينحني المصلّي بظهره ورأسه حتّى تبلغ يداه رُكبتيه، ودليل ركنيّته قول الله -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا)، مطمئنّاً قدر تسبيحةٍ، والدليل عليه ما نصّ عليه النبيّ -صلّى الله عليه وسلّم- في الحديث الذي علّم فيه الصحابي الذي صلّى أمامه فلم يحسن صلاته، فقال له رسول الله: (...ثمَّ اركَع حتَّى تطمئنَّ راكعًا). الرفع من الركوع والاعتدال قائماً مطمئناً: وهو ركنٌ عند جمهور الفقهاء وأبي يوسف من الحنفيّة، وواجبٌ عند أبي حنفية ومحمد، ويقصد بالاعتدال العودة إلى الهيئة التي كان عليها المصلّي قبل الركوع؛ أي الاستواء قائماً للقادر على القيام والاستواء قاعداً لمن صلّى قاعداً؛ لعجزه عن القيام. ودليل الاعتدال من الركوع والاطمئنان فيه؛ فعل النبيّ -صلّى الله عليه وسلّم- في صلاته على الاعتدال قائماً مطمئنّاً من الركوع، والمسلم مأمورٌ باتّباع فعل النبيّ والاقتداء به كما جاء في الحديث الشريف: (...وصَلُّوا كما رَأَيْتُمُونِي أُصَلِّي)، وما قاله لمَن لم يُحسن صلاته: (ثُمَّ ارْفَعْ حتَّى تَعْدِلَ قَائِمًا). السجود والطمأنينة فيه: فالسجود مرّتين لكلّ ركعةٍ، والرفع بعد كلّ واحدٍ منهما ركنٌ في الصّلاة، وأكمل السجود ما كان على سبعة أعضاءٍ ملامسةٍ للأرض، وهي؛ الجبهة، والأنف، واليدان، والركبتان، وأطراف القدمين، ودليل كون السجود والاطمئنان ركناً؛ قول النبيّ -صلّى الله عليه وسلّم-: (...ثُمَّ اسْجُدْ حتَّى تَطْمَئِنَّ سَاجِدًا). الجلوس بين السجدتين والطمأنينة فيه: وهو ركنٌ عند جمهور الفقهاء، وواجبٌ عند الحنفية، ودليله قول رسول الله: (ثُمَّ ارْفَعْ حتَّى تَطْمَئِنَّ جَالِسًا). الجلوس الأخير والتشهّد: وذلك بقول المصلي في الركعة الأخيرة من صلاته: (التَّحِيَّاتُ لِلَّهِ، والصَّلَوَاتُ، والطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللَّهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ، وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ). وأضاف الشافعية والحنابلة قول المصلّي باعتباره ركناً: (اللَّهُمَّ صَلِّ علَى مُحَمَّدٍ، وعلَى آلِ مُحَمَّدٍ، كما صَلَّيْتَ علَى آلِ إبْرَاهِيمَ، إنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ علَى مُحَمَّدٍ وعلَى آلِ مُحَمَّدٍ، كما بَارَكْتَ علَى آلِ إبْرَاهِيمَ، إنَّكَ حَمِيدٌ مَجِيدٌ)، واكتفى المالكية بركن الجلوس للسلام. السّلام: والتسليمة الأولى ركنٌ عند المالكيّة والشافعيّة، وأمّا عند الحنابلة فالتسليمتان ركنٌ في الصلوات المفروضة، وهي آخر ما يختم به المصلّي صلاته، واعتبر الحنفية التسليمتان واجبتان. الطمأنينة: وقد اعتبرها الشافعية والمالكية والحنابلة ركنٌ، واعتبرها الحنفية واجبٌ، ويُراد بها السكون بين حركات وأفعال الصلاة. الترتيب: فأداء أركان الصلاة مرتّبةً كما أدّاها النبيّ -صلّى الله عليه وسلّم- ركنٌ عند الجمهور، وعدم أدائها بالترتيب مدعاةٌ لبطلان الصلاة، ولو كان عدم الترتيب سهواً عن غير قصدٍ بإجماع الفقهاء، أمّا الحنفية فقالوا بأنّ الترتيب واجباً في الأفعال المكرّرة في كلّ ركعةٍ؛ كالقراءة، وفرضٌ في الأفعال غير المكرّرة في كلّ ركعةٍ."
    ),
    ExploreData.DetailSalahData(
        title = "سنن الصلاة",
        description = "من سنن الصلاة ما يأتي: قراءة دعاء الاستفتاح والتعوذ والتكبير لانتقالاتها ورفع اليدين له. وضع اليد اليمنى على ظهر اليسرى وقراءة سورة بعد الفاتحة. الجهر في الصلاة الجهرية والإسرار في السرية. أن يقول سمع الله لمن حمده عند قيامه من الركوع، وأن يقول (ربنا لك الحمد) عند اعتداله. التسبيح في الركوع بقوله: (سبحان ربي العظيم) ثلاث مرات كأقل الكمال، وكذلك التسبيح في سجوده بقوله: (سبحان ربي الأعلى). الدعاء بين السجدتين بقوله: (رب اغفر لي وارحمني واجبرني وارفعني واهدني وعافني)، أو قوله: (رب اغفر لي). التشهد الأول والجلوس له، وجلسة الافتراش* في التشهد الأول، والتورك* في التشهد الأخير. الدعاء بعد الصلاة على النبي قبل السلام. للتسليم من الصلاة كذلك سننٌ، منها: أن يقول المصلّي: \"السّلام عليكم ورحمة الله\"، وورد من طُرقٍ عدّةٍ زيادة قول: \"وبركاته\"، ويسنّ أن يُسلّم التسليمة الثانية، وإن لم يسلّم الإمام إلّا تسليمةً واحدةً. أمّا بعد التسليم والفراغ من الصلاة، فيسنّ للمصلي: الاستغفار ثلاثاً. قول ما ورد عن النبيّ -صلّى الله عليه وسلّم- من دعاء ما بعد الصلاة: (اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ). التسبيح، والحمد، والتكبير ثلاثاً وثلاثين مرّةً لكلّ ذكرٍ منها. قراءة المعوّذات وتكرارها ثلاثاً في صلاتي الفجر والمغرب. قراءة آية الكرسي، بالإضافة إلى جملةٍ من الأذكار والأدعية المأثورة عن النبيّ -صلّى الله عليه وسلّم-، والوارد أنّه كان يقولها بعد الصلاة. وتتفرّع سنن الصلاة إلى قسمين عند الشافعيّة: أبعاضٌ وهيئاتٌ؛ فالأبعاض هي السنن التي إن تُركت ولم تؤدّى، لا تُجبر إلّا بسجود السهو، وتتمثّل في؛ التشهّد الأوّل، والقعود له، والصلاة على النبيّ -صلّى الله عليه وسلّم- بعده، والصلاة على آل النبيّ بعد التشهّد الأخير، والقنوت في صلاة الفجر وفي الوتر في النصف الثاني من شهر رمضان، والقيام له، والصلاة على النبيّ بعده. وأمّا الهيئات؛ فهي التي لا يلزم من تركها وعدم أدائها سجود السهو، وهي كلّ ما سِوى الأبعاض والأركان السابقة الذكر من أعمال الصلاة، أما المالكية فذهبوا إلى أن من ترك ثلاث سنن قولية أو فعلية في الصلاة فعليه أن يسجد للسهو، أما ترك السنة عند الحنابلة والحنفية فلا سجود للسهو لعمده ولا لسهوه عند الحنفية، ويجوز السجود لسهوه وحول استحبابه رأيان الاستحباب وعدمه عند الحنابلة."
    ),
    ExploreData.DetailSalahData(
        title = "مكروهات الصلاة",
        description = "من الأفعال التي يُكره للمصلّي إتيانها في الصلاة: أن يلتفت في صلاته لغير عذرٍ؛ كعدم الخوف. رفع النظر للسماء. افتراش الذراعين عند السجود. افتراش القدمين بعد الرفع من السجود. العبث في الصلاة مكروهٌ؛ كالتهوية بيديه، وفرقعة الأصابع وتشبيكها، والصلاة أمام ما يلهيه؛ كبابٍ مفتوحٍ، أو أن يصلّي أمام صورةٍ أو نارٍ. الدخول في الصلاة حابساً بوله، كما يُكره دخوله فيها وهو يغالب جوعاً، أو عطشاً، أو برداً، أو حرّاً مُفرطاً؛ لِما في ذلك من تفويتٍ للخشوع. أن يخصّ المصلّي جبهته بما يسجد عليه. مسح جبهته أو لحيته. ثني ثوبه. تكرار سورة الفاتحة في الركعة الواحدة."
    ),
    ExploreData.DetailSalahData(
        title = "مبطلات الصلاة",

        description = "من الأفعال التي يُكره للمصلّي إتيانها في الصلاة: أن يلتفت في صلاته لغير عذرٍ؛ كعدم الخوف. رفع النظر للسماء. افتراش الذراعين عند السجود. افتراش القدمين بعد الرفع من السجود. العبث في الصلاة مكروهٌ؛ كالتهوية بيديه، وفرقعة الأصابع وتشبيكها، والصلاة أمام ما يلهيه؛ كبابٍ مفتوحٍ، أو أن يصلّي أمام صورةٍ أو نارٍ. الدخول في الصلاة حابساً بوله، كما يُكره دخوله فيها وهو يغالب جوعاً، أو عطشاً، أو برداً، أو حرّاً مُفرطاً؛ لِما في ذلك من تفويتٍ للخشوع. أن يخصّ المصلّي جبهته بما يسجد عليه. مسح جبهته أو لحيته. ثني ثوبه. تكرار سورة الفاتحة في الركعة الواحدة. مبطلات الصلاة ثمّة جملةٌ من الأعمال تناولها الفقهاء، إن هي بدرت من المصلّي بطلت صلاته، وهي: الحدث: إذ إنّ وقوع الحدث في الصلاة يُبطلها، وعلى المصلّي حينها إعادة الصلاة، بدليل قول الرسول -عليه الصلاة والسلام-: (لا تُقْبَلُ صَلاةٌ بغيرِ طُهُورٍ). التوجّه لغير القبلة: تفسد صلاة من تحوّل لغير القبلة عمداً دون عذرٍ، كما أجمع على ذلك العلماء. ترك ركنٍ من أركان الصلاة: تبطُل الصلاة بترك ركنٍ من أركانها قصداً، استدلالاً بحديث المسيء لصلاته؛ إذ جعل الرسول -عليه الصلاة والسلام- ترك بعض الأركان من الصلاة كانعدامها، كما نقل الإمام النووي الإجماع على ذلك. الكلام: تبطل الصلاة بالكلام الصادر من المصلّي عمداً، إن كان عالماً بحُرمة الكلام فيها، وإن كان الكلام لغير مصلحة الصلاة، أو مصلحة مسلمٍ؛ كإنقاذه من ضررٍ ما، والدليل في ذلك قول الرسول -عليه الصلاة والسلام-: (إنَّ هذِه الصَّلَاةَ لا يَصْلُحُ فِيهَا شيءٌ مِن كَلَامِ النَّاسِ، إنَّما هو التَّسْبِيحُ والتَّكْبِيرُ وقِرَاءَةُ القُرْآنِ). الضحك والقهقهة*: نصّ غير واحدٍ من العلماء؛ كابن المنذر وابن حزم، إجماع العلماء على فساد الصلاة بسبب الضحك والقهقهة. العمل الكثير دون ضرورةٍ: تبطل صلاة المصلي المتعمّد للحركة الكثيرة بلا عذرٍ. المشي: مشي المصلّي الكثير خلال صلاته يُبطلها. الأكل والشرب عمداً: تبطل صلاة من أكل أو شرب عمداً في صلاته."

    )
)

val detailSoumData = listOf(
    ExploreData.DetailSoumData(
        title = "فضل الصوم",
        description = "وردت في فضل الصوم أحاديث كثيرة، منها ما يلي:\n" +
                "\n" +
                "      أ- عن أبي هريرة رضي الله تعالى عنه عن النبي صلى الله عليه وسلم أنه قال: \"من صام رمضان إيماناً واحتساباً، غفر له ما تقدم من ذنبه، ومن قام ليلة القدر إيماناً واحتساباً غفر له ما تقدم من ذنبه\". رواه البخاري.\n" +
                "\n" +
                "      ب- وعن أبي هريرة رضي الله تعالى عنه قال: \"كان النبي صلى الله عليه وسلم يبشر أصحابه بقدوم رمضان، يقول: قد جاءكم شهر رمضان، شهر مبارك، كتب عليكم صيامه، تفتح فيه أبواب الجنة، وتغلق فيه أبواب الجحيم، وتُغَلّ فيه الشياطين، فيه ليلة خير من ألف شهر\" رواه النسائي وأحمد.\n" +
                "\n" +
                "      جـ- وعن سهل بن سعد رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"إن في الجنة باباً، يقال له: الريان، يدخل منه الصائمون يوم القيامة، لا يدخل منه أحد غيرهم، يقال: أين الصائمون؟ فيقومون، لا يدخل منه أحد غيرهم، فإذا دخلوا أغلق، فلم يدخل منه أحد\" رواه البخاري.\n" +
                "\n" +
                "      د- وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"رَغِمَ أَنفُ رجل دخل عليه رمضان، ثم انسلخ قبل أن يغفر له\" رواه الترمذي."
    ),
    ExploreData.DetailSoumData(
        title = "حكمة الصوم",
        description = "تتجلى حكمة الصوم في عدة أمور:\n" +
                "\n" +
                "      أ- أن الصوم وسيلة إلى شكر النعمة، إذ هو كف النفس عن الأكل والشرب والجماع، وإنها من أجلِّ النعم وأعلاها، والامتناع عنها زماناً معتبراً يعرّف قدرها، إذ النعم مجهولة، فإذا فقدت عرفت، فيحمله ذلك على قضاء حقها بالشكر، وشكر النعم فرض عقلاً وشرعاً، وإليه أشار الرب سبحانه وتعالى بقوله في آية الصيام:\n" +
                "\n" +
                "{وَلَعَلَّكُمْ تَشْكُرُونَ} [البقرة: 185].\n" +
                "\n" +
                "      ب- أن الصوم وسيلة إلى التقوى، لأنه إذا انقادت نفس للامتناع عن الحلال طمعاً في مرضاة الله تعالى، وخوفاً من أليم عقابه، فأولى أن تنقاد للامتناع عن الحرام، فكان الصوم سبباً لاتقاء محارم الله تعالى، وإنه فرض، وإليه وقعت الإشارة بقوله تعالى في آخر آية الصوم {لَعَلَّكُمْ تَتَّقُون} [البقرة: 183].\n" +
                "\n" +
                "      ج- أن في الصوم قهر الطبع وكسر الشهوة، لأن النفس إذا شبعت تمنت الشهوات، وإذا جاعت امتنعت عما تهوى، ولذا قال النبي صلى الله عليه وسلم: \"يا معشر الشباب: من استطاع منكم الباءة فليتزوج، فإنه أغض للبصر، وأحصن للفرج، ومن لم يستطع فعليه بالصوم، فإنه له رجاء\" رواه البخاري، فكان الصوم ذريعة إلى الامتناع عن المعاصي.\n" +
                "\n" +
                "      د- أن الصوم موجب للرحمة والعطف على المساكين، فإن الصائم إذا ذاق ألم الجوع في بعض الأوقات، ذكر مَنْ هذا حاله في جميع الأوقات، فتسارع إليه الرقة عليه، والرحمة به، بالإحسان إليه، فينال بذلك ما عند الله تعالى من حسن الجزاء.\n" +
                "\n" +
                "      هـ- في الصوم قهر للشيطان، فإن وسيلته إلى الإضلال والإغواء : الشهوات، وإنما اتقاء الشهوات بالأكل والشرب، وذلك جاء في حديث صفية رضي الله عنها قوله -عليه الصلاة والسلام-: \"إن الشيطان ليجري من ابن آدم مجرى الدم، فضيقوا مجاريه بالجوع\" متفق عليه."
    ),
    ExploreData.DetailSoumData(
        title = "أنواع الصوم",
        description = "ينقسم الصوم إلى صوم عين، وصوم دين.\n" +
                "\n" +
                "      1- صوم العين: ماله وقت معين:\n" +
                "\n" +
                "      أ- إما بتعيين الله تعالى، كصوم رمضان، وصوم التطوع خارج رمضان، لأن خارج رمضان متعين للنفل شرعاً.\n" +
                "\n" +
                "      ب- وإما بتعيين العبد، كالصوم المنذور به في وقت بعينه.\n" +
                "\n" +
                "      2- صوم الدين: ما ليس له وقت معين، كصوم قضاء رمضان، وصوم كفارة القتل والظهار واليمين والإفطار في رمضان، وصوم متعة الحج، وصوم فدية الحلق، وصوم جزاء الصيد، وصوم النذر المطلق عن الوقت، وصوم اليمين، بأن قال: والله لأصومن شهراً.\n" +
                "\n" +
                "      الصوم المفروض\n" +
                "\n" +
                "      ينقسم الصوم المفروض من العين والدين، إلى قسمين: منه ما هو متتابع، ومنه ما هو غير متتابع، بل صاحبه بالخيار: إن شاء تابع، وإن شاء فرق.\n" +
                "\n" +
                "      أولاً: ما يجب فيه التتابع، ويشمل ما يلي:\n" +
                "\n" +
                "1.        أ- صوم رمضان، فقد أمر الله تعالى بصوم الشهر بقوله سبحانه:\n" +
                "\n" +
                "2.  {فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ} والشهر متتابع، لتتابع أيامه، فيكون صومه متتابعاً ضرورة.\n" +
                "\n" +
                "      ب- صوم كفارة القتل الخطأ، وصوم كفارة الظهار، والصوم المنذور به في وقت بعينه، وصوم كفارة الجماع في نهار رمضان.\n" +
                "\n" +
                "      ثانياً: ما لا يجب فيه التتابع، ويشمل ما يلي:\n" +
                "\n" +
                "1.  قضاء رمضان، ذهب الأئمة الأربعة عدم اشتراط التتابع فيه، لقوله تعالى:\n" +
                "\n" +
                "{فعدة من أيام أخر} [البقرة: 184] فإنه ذكر الصوم مطلقاً عن التتابع.\n" +
                "\n" +
                "      ويندب التتابع أو استحبابه للمسارعة إلى إسقاط الفرض.\n" +
                "\n" +
                "      ب- الصوم في كفارة اليمين، وفي تتابعة خلاف.\n" +
                "\n" +
                "      ج- صوم المتعة في الحج، وصوم كفارة الحلق، وصوم جزاء الصيد، وصوم النذر المطلق، وصوم اليمين المطلقة.\n" +
                "\n" +
                "      قال الله -عز وجل- في صوم المتعة: {فمن تمتّع بالعمرة إلى الحج فما استيسر من الهدى، فمن لم يجد فصيام ثلاثة أيام في الحج، وسبعة إذا رجعتم ..} [البقرة: 196].\n" +
                "\n" +
                "      وقال في كفارة الحلق: {ولا تحلقوا رؤوسكم حتى يَبْلُغ الهدىُ مَحِلَّه فمن كان منكم مريضاً أو به أذى من رأسه، ففِدْية من صيام، أو صدقة أو نُسُك ...} [البقرة: 195].\n" +
                "\n" +
                "      وقال في جزاء الصيد: {أو عَدْلُ ذلك صياماً، ليذوق وبال أمره} [المائدة: 92] فذكر الصوم في هذه الآيات مطلقاً عن شرط التتابع.\n" +
                "\n" +
                "      وكذا: الناذر، والحالف في النذر المطلق، واليمين المطلقة، ذكر الصوم فيها مطلقاً عن شرط التتابع.\n" +
                "\n" +
                "      الصوم المختلف في وجوبه، ويشمل ما يلي:\n" +
                "\n" +
                "      - الأول، وهو: قضاء ما أفسده من صوم النفل .\n" +
                "\n" +
                "      ذهب الحنفية والمالكية إلى أن قضاء نفل الصوم إذا أفسده واجب، دليل ذلك حديث عائشة رضي الله تعالى عنها قالت: \"كنت أنا وحفصة صائمتين، فعرض لنا طعام اشتهيناه، فأكلنا منه، فجاء رسول الله صلى الله عليه وسلم فبدرتني إليه حفصة -وكانت ابنة أبيها- فقالت يا رسول الله: إنا كنا صائمتين، فعرض لنا طعام اشتهيناه فأكلنا منه قال: اقضيا يوماً آخر مكانه\" رواه الترمذي.\n" +
                "\n" +
                "      ولأن ما أتى به قربة، فيجب صيانته وحفظه عن البطلان، وقضاؤه عند الإفساد، لقوله تعالى: {ولا تبطلوا أعمالكم} [محمد: 33] ولا يمكن ذلك إلا بإتيان الباقي، فيجب إتمامه وقضاؤه عند الإفساد ضرورة،فصار كالحج والعمرة المتطوّعين.\n" +
                "\n" +
                "      والحنفية لا يختلفون في وجوب القضاء إذا فسد صوم النافلة عن قصد، أو غير قصد بأن عرض الحيض للصائمة المتطوعة.\n" +
                "\n" +
                "      والضيافة عذر، إن كان صاحبها ممن لا يرضى بمجرد حضوره، ويتأذى بترك الإفطار، فيفطر، وإلا لا، حتى لو حلف عليه رجل بالطلاق الثلاث، أفطر ولو كان صومه قضاء، ولا يحنثه على المعتمد.\n" +
                "\n" +
                "      وإن كان صاحب الطعام يرضى بمجرد حضوره، وإن لم يأكل، لا يباح له الفطر، وإن كان يتأذى بذلك يفطر.\n" +
                "\n" +
                "      وهذا إذا كان قبل الزوال، أما بعده فلا، إلا لأحد أبويه إلى العصر، لا بعده.\n" +
                "\n" +
                "      والمالكية أوجبوا القضاء بالفطر العمد الحرام، احترازاً عن الفطر نسياناً أو إكراهاً، أو بسبب الحيض والنفاس، أو خوف مرض أو زيادته، أو شدة جوع أو عطش، حتى لو أفطر لحلف شخص عليه بطلاق باتٍ، فلا يجوز الفطر، وإن أفطر قضى.\n" +
                "\n" +
                "      واستثنوا ما إذا كان لفطره وجه:\n" +
                "\n" +
                "      - كأن حلف بطلاقها، ويخشى أن لا يتركها إن حنث، فيجوز الفطر ولا قضاء.\n" +
                "\n" +
                "      - أو أن يأمره أبوه أو أمه بالفطر، حناناً وإشفاقاً عليه من إدامة الصوم، فيجوز له الفطر، ولا قضاء عليه.\n" +
                "\n" +
                "      - أو يأمره أستاذه أو مربيه بالإفطار، وإن لم يحلف الوالدان أو الشيخ.\n" +
                "\n" +
                "      والشافعية والحنابلة، لا يوجبون إتمام نافلة الصوم، ولا يوجبون قضاءها إن فسدت، وذلك:\n" +
                "\n" +
                "      - لقول عائشة رضي الله تعالى عنها: \"يا رسول الله! أهدى إلينا حيس(1) فقال: أرنيه فلقد أصبحت صائماً فأكل\" رواه مسلم وزاد النسائي: \"إنما مثل صوم المتطوع مثل الرجل يخرج من ماله الصدقة، فإن شاء أمضاها، وإن شاء حبسها\".\n" +
                "\n" +
                "___________________\n" +
                "\n" +
                "(1) تمر مخلوط بسمن ولبن مخفق.\n" +
                "\n" +
                "      - ولحديث أم هانئ رضي الله تعالى عنها \"أن رسول الله صلى الله عليه وسلم دخل عليها، فدعا بشراب فشرب، ثم ناولها فشربت، فقالت: يا رسول الله! أما إني كنت صائمة! فقال رسول الله صلى الله عليه وسلم: \"الصائم المتطوع أمين نفسه، إن شاء صام، وإن شاء أفطر\" رواه الترمذي، وفي رواية: \"أمير نفسه\".\n" +
                "\n" +
                "      - ولأن القضاء يتبع المقضى عنه، فإذا لم يكن واجباً، لم يكن القضاء واجباً، بل يستحب.\n" +
                "\n" +
                "      - ونص الشافعية والحنابلة على أن من شرع في نافلة صوم لم يلزمه الإتمام، لكن يستحب، ولا كراهة ولا قضاء في قطع صوم التطوع مع العذر.\n" +
                "\n" +
                "      أما مع عدم العذر فيكره، لقوله تعالى: {ولا تبطلوا أعمالكم} [محمد: 33].\n" +
                "\n" +
                "      ومن العذر: أن يعز على من ضيّفه امتناعه من الأكل.\n" +
                "\n" +
                "      وإذا أفطر فإنه لا يثاب على ما مضى إن أفطر بغير عذر، وإلا أثيب.\n" +
                "\n" +
                "      الثاني: صوم الإعتكاف، وفيه خلاف.\n" +
                "\n" +
                "      صوم التطوع\n" +
                "\n" +
                "      وهو:\n" +
                "\n" +
                "      1- صوم يوم عاشوراء.\n" +
                "\n" +
                "      2- صوم يوم عرفة.\n" +
                "\n" +
                "      3- صوم يوم الإثنين والخميس من كل أسبوع.\n" +
                "\n" +
                "      4- صيام ثلاثة أيام من كل شهر، وهي الأيام البيض.\n" +
                "\n" +
                "      5- صيام ستة أيام من شوال.\n" +
                "\n" +
                "      6- صوم شهر شعبان.\n" +
                "\n" +
                "      7- صوم شهر محرم.\n" +
                "\n" +
                "      8- صوم شهر رجب.\n" +
                "\n" +
                "      9- صيام ما ثبت طلبه والوعد عليه في السنة الشريفة.\n" +
                "\n" +
                "      الصوم المكروه\n" +
                "\n" +
                "ويشمل ما يلي:\n" +
                "\n" +
                "      أ- إفراد يوم الجمعة بالصوم:\n" +
                "\n" +
                "      ذهب الجمهور إلى كراهة إفراد يوم الجمعة بالصوم، وقد ورد فيه حديث عن أبي هريرة -رضي الله تعالى عنه- قال: قال رسول الله -صلى الله عليه وسلم-: \"لا تصوموا يوم الجمعة، إلا وقبله يوم، أو بعده يوم\" رواه البخاري.\n" +
                "\n" +
                "      وذهب أبو حنيفة إلى أنه لابأس بصومه منفرداً، لما روي عن ابن عباس رضي الله تعالى عنهما أنه كان يصومه ولا يفطر، وظاهر هذا أن المراد (لا بأس) الاستحباب، بندب صومه، ولو منفرداً. وذهب المالكية إلى ندب صومه منفرداً وحده فقط، لا قبله ولا بعده، فإن ضم إليه آخر فلا خلاف في ندبه.\n" +
                "\n" +
                "      قال الجمهور: فمطلق النهي عن صومه مقيد بالإفراد.\n" +
                "\n" +
                "      وتنتفي الكراهة بضم يوم آخر إليه، لحديث جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم. دخل عليها يوم الجمعة، وهي صائمة، فقال: \"أصمت أمس\"؟ قالت: لا. قال: \"تريدين أن تصومي غداً\"؟ قالت: لا. قال: \"فأفطري\" رواه البخاري.\n" +
                "\n" +
                "      ب- صوم يوم السبت وحده خصوصاً:\n" +
                "\n" +
                "      وهو متفق على كراهته، وقد ورد فيه حديث عبد الله بن بسر، عن أخته، واسمها الصماء رضي الله تعالى عنهما أن رسول الله صلى الله عليه وسلم قال : \"لا تصوموا يوم السبت إلا فيما افترض عليكم، فإن لم يجد احدكم إلا لحاء عنبة أو عود شجرة فليمضغه\" رواه الترمذي.\n" +
                "\n" +
                "      ووجه الكراهة أنه يوم تعظمه اليهود، ففي إفراده بالصوم تشبه بهم، إلا أن يوافق صومه بخصوص يومٍ اعتاد صومه، كيوم عرفة أو عاشوراء.\n" +
                "\n" +
                "      ج- صوم يوم الأحد بخصوصه:\n" +
                "\n" +
                "      ذهب الحنفية والشافعية إلى أن تعمد صوم يوم الأحد بخصوصه مكروه، إلا إذا وافق يوماً كان يصومه، وإن صوم السبت والأحد معاً ليس فيه تشبه باليهود والنصارى، لأنه لم تتفق طائفة منهم على تعظيمهما، كما لو صام الأحد مع الإثنين، فإنه تزول الكراهة.\n" +
                "\n" +
                "      ونص الحنابلة أنه يكره صيام كل عيد لليهود والنصارى أو يوم يفردونه بالتعظيم إلا أن يوافق عادة للصائم.\n" +
                "\n" +
                " \n" +
                "\n" +
                "      د- إفراد يوم النيروز بالصوم:\n" +
                "\n" +
                "      يكره إفراد يوم النيروز(1)، ويوم المهرجان(2) بالصوم، وذلك لأنهما يومان يعظمهما الكفار، وهما عيدان للفرس، فيكون تخصيصهما بالصوم -دون غيرهما- موافقة لهم في تعظيمهما، فكره، كيوم السبت.\n" +
                "\n" +
                "      وعلى قياس هذا كل عيد للكفار، أو يوم يفردونه بالتعظيم.\n" +
                "\n" +
                "      وقال الحنفية: إن الصائم إذا قصد بصومه التشبه، كانت الكراهة تحريمية.\n" +
                "\n" +
                "      هـ- صوم الوصال:\n" +
                "\n" +
                "      ذهب جمهور الفقهاء (الحنفية والمالكية والحنابلة) إلى كراهة صوم الوصال، وهو : أن لا يفطر بعد الغروب أصلاً، حتى يتصل صوم الغد بالأمس، فلا يفطر بين يومين.\n" +
                "\n" +
                "      وإنما كره، لما روي عن ابن عمر -رضي الله تعالى عنهما- قال: \"واصل رسول الله صلى الله عليه وسلم في رمضان، فواصل الناس .. فنهاهم، قيل له: إنك تواصل، قال: إني لست مثلكم، إني أطعم وأسقى\" رواه البخاري.\n" +
                "\n" +
                "      والنهي وقع رفقاً ورحمةً، ولهذا واصل النبي صلى الله عليه وسلم.\n" +
                "\n" +
                "      وتزول الكراهة بأكل تمرة ونحوها، وكذا بمجرد الشرب لانتفاء الوصال.\n" +
                "\n" +
                "      وقال الحنابلة: ولا يكره الوصال إلى السحر، لحديث أبي سعيد -رضي الله عنه- مرفوعاً: \"فأيكم إذا أراد أن يواصل، فليواصل حتى السحر\" رواه البخاري ولكنه ترك سنة، وهي: تعجيل الفطر، فترك ذلك أولى محافظة على السنة.\n" +
                "\n" +
                "      وعند الشافعية قولان: الأول وهو الصحيح: بأن الوصال مكروه كراهة تحريم، وهو ظاهر نص الشافعي رحمه الله.\n" +
                "\n" +
                "      والثاني: يكره كراهة تنزيه.\n" +
                "\n" +
                "      و- صوم الدهر (صوم العمر):\n" +
                "\n" +
                "      ذهب جمهور الفقهاء (الحنفية والمالكية والحنابلة) إلى كراهة صوم الدهر، وعللت الكراهة بأنه يضعف الصائم عن الفرائض والواجبات، والكسب الذي لا بد منه، أو بأنه يصير الصوم طبعاً له، ومبنى العبادة على مخالفة العادة.\n" +
                "\n" +
                "      واستدل للكراهة، بحديث عبد الله بن عمرو بن العاص -رضي الله تعالى عنهما- قال: قال رسول الله صلى الله عليه وسلم: \"لا صام من صام الأبد\" متفق عليه.\n" +
                "\n" +
                "      وفي حديث أبي قتادة -رضي الله عنه- قال: \"قال عمر: يا رسول الله كيف بمن يصوم الدهر كله؟ قال: لا صام ولا أفطر، أو لم يصم ولم يفطر\" رواه مسلم، أي: لم يحصّل أجر الصوم لمخالفته، ولم يفطر لأنه أمسك.\n" +
                "\n" +
                "      وقال الشافعية: إن خاف منه ضرراً، أو فَوَّتَ به حقاً كره، وإلا فلا.\n" +
                "\n" +
                "      والمراد بصوم الدهر عند الشافعية: سرد الصوم في جميع الأيام إلا الأيام التي لا يصح صومها وهي : العيدان وأيام التشريق.\n" +
                "\n" +
                "      الصوم المحرم\n" +
                "\n" +
                "      ذهب الجمهور (المالكية والشافعية والحنابلة) إلى تحريم صوم الأيام التالية:\n" +
                "\n" +
                "      أ- صوم يوم عيد الفطر، ويوم عيد الأضحى، وأيام التشريق، وهي: ثلاثة أيام بعد يوم النحر.\n" +
                "\n" +
                "      وذلك لأن هذه الأيام منع صومها لحديث أبي سعيد -رضي الله عنه- \"أن رسول الله صلى الله عليه وسلم نهى عن صيام يومين: يوم الفطر، ويوم النحر\" رواه البخاري.\n" +
                "\n" +
                "      وحديث نبيشة الهذلي -رضي الله تعالى عنه- قال: قال رسول الله صلى الله عليه وسلم: \"أيام التشريق ايام أكل وشرب، وذكر الله - عز وجل\" رواه مسلم.\n" +
                "\n" +
                "      وذهب الحنفية إلى جواز الصوم فيها مع الكراهة التحريمية، لما في صومها من الإعراض عن ضيافة الله تعالى، فالكراهة ليست لذات اليوم، بل لمعنى خارج مجاور، كالبيع عند الأذان يوم الجمعة، حتى لو نذر صومها صح، ويفطر وجوباً تحامياً عن المعصية، ويقضيها إسقاط للواجب، ولو صامها خرج عن العهدة، مع الحرمة.\n" +
                "\n" +
                "      وقال الحنابلة إن صومها لا يصح فرضاً ولا نفلاً.\n" +
                "\n" +
                "      واستثنى المالكية والحنابلة في رواية: صوم أيام التشريق عن دم المتعة والقران، لقول ابن عمر وعائشة -رضي الله تعالى عنهم- لم يرخص في أيام التشريق أن يُصَمْنَ إلا لمن لم يجد الهدى.\n" +
                "\n" +
                "      قال الشافعية: وأما صوم يوم النحر، فقطع ببطلانه، لأنه لم يظهر انصراف النهي عن عينه ووصفه، ولم يرتض قولهم: إنه نهى عنه، لما فيه من ترك إجابة الدعوى بالأكل.\n" +
                "\n" +
                "      ب- ويحرم صيام الحائض والنفساء، وصيام من يخاف على نفسه الهلاك بصومه."
    ),
    ExploreData.DetailSoumData(
        title = "متى يجب الصوم؟",
        description = "يجب الصوم بأحد أمور ثلاثة.\n" +
                "\n" +
                "      الأول: النذر: بأن ينذر المرء صوم يوم أو شهر تقرباً إلى الله تعالى، فيجب عليه بإيجابه على نفسه، ويكون سبب صوم المنذور هو النذر، فلو عين شهراً أو يوماً، وصام شهراً أو يوماً قبله عنه، أجزأه، لوجود السبب، ويلغو التعيين.\n" +
                "\n" +
                "      الثاني: الكفارات: عن معصية ارتكبها المرء، كالقتل الخطأ، وحنث اليمين، وإفطار رمضان بالجماع نهاراً، والظهار، ويكون سبب الصوم هو القتل أو الحنث أو الإفطار، أو المظاهرة.\n" +
                "\n" +
                "      الثالث: شهود جزء من شهر رمضان من ليل أو نهار على المختار عند الحنفية، فيكون السبب شهود الشهر.\n" +
                "\n" +
                "      ويجب صوم رمضان: إما برؤية هلاله إذا كانت السماء صحواً، أو بإكمال شعبان ثلاثين يوماً إذا وجد غيم أو غبار ونحوهما.\n" +
                "\n" +
                "      لقوله تعالى: {فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ}.\n" +
                "\n" +
                "      وقوله صلى الله عليه وسلم: \"صومواً لرؤيته، وأفطروا لرؤيته، فإن غمّ عليكم فأكملوا عدة شعبان ثلاثين\" رواه مسلم وفي لفظ البخاري: \"الشهر تسع وعشرون ليلة، فلا تصوموا حتى تروه، فإن غم عليكم فأكملوا العدة ثلاثين\" وفي لفظ لمسلم: \"أنه ذكر رمضان، فضرب بيديه، فقال: الشهر هكذا وهكذا وهكذا، ثم عقد إبهامه في الثالثة، فصوموا لرؤيته، وأفطروا لرؤيته، فإن غم عليكم فاقُدروا ثلاثين\".\n" +
                "\n" +
                "      وقد يقع نقص الشهر أي تسعة وعشرين يوماً مدة شهرين أو ثلاثة أو أربعة فقط، ولا تثبت بقية توابع رمضان كصلاة التراويح ووجوب الإمساك على من أصبح مفطراً إلا برؤية الهلال، أو إكمال شعبان ثلاثين يوماً."
    ),
    ExploreData.DetailSoumData(
        title = "كيفية إثبات هلال رمضان وهلال شوال",
        description = "اختلف الفقهاء في طريق إثبات هلال رمضان وشوال بين اتجاهات ثلاثة: رؤية جمع عظيم، ورؤية مسلميَن عدلين، ورؤية رجل عدل واحد.\n" +
                "\n" +
                "      ذهب الحنفية إلى أنه:\n" +
                "\n" +
                "      أ- إذا كانت السماء صحواً: فلا بد من رؤية جمع عظيم لإثبات رمضان، والفطر أو العيد، ومقدار الجمع: من يقع العلم الشرعي (أي غلبه الظن) بخبرهم، وتقديرهم مفوض إلى رأي الإمام في الأصح، واشتراط الجمع لأن المَطْلع متحد في ذلك المحل، والموانع منتفية، والأبصار سليمة، والهمم في طلب الهلال مستقيمة، فالتفرد في الرؤية من بين الجم الغفير -مع ذلك- ظاهر في غلط الرأي.\n" +
                "\n" +
                "      ولا بد من أن يقول الواحد منهم في الإدلاء بشهادته: \"أشهد\".\n" +
                "\n" +
                "      ب- وأما إذا لم تكن السماء صحواً بسبب غيم أو غبار ونحوه: اكتفى الإمام في رؤية الهلال بشهادة مسلم واحد عدل عاقل بالغ، (والعدل: هو الذي غلبت حسناته سيئاته) أو مستور الحال في الصحيح، رجلاً كان أو امرأة، حراً أم غيره، لأنه أمر ديني، فأشبه رواية الأخبار. ولا يشترط في هذه الحالة أن يقول: \"أشهد\" وتكون الشهادة في مصر أمام القاضي، وفي القرية في المسجد بين الناس.\n" +
                "\n" +
                "      وتجوز الشهادة على الشهادة، فتصح الشهادة أمام القاضي بناء على شهادة شخص آخر رأى الهلال.\n" +
                "\n" +
                "      ومن رأى الهلال وحده، صام، وإن لم يقبل الإمام شهادته، فلو أفطر وجب عليه القضاء دون الكفارة.\n" +
                "\n" +
                "      ولا يعتمد على ما يُخبِر به أهل الميقات والحساب والتنجيم، لمخالفته شريعة نبينا عليه أفضل الصلاة والتسليم.\n" +
                "\n" +
                "      وذهب المالكية: إلى أنه يثبت هلال رمضان بالرؤية على أوجه ثلاثة هي ما يأتي:\n" +
                "\n" +
                "      1- أن يراه جماعة كثيرة وإن لم يكونوا عدولاً: وهم كل عدد يؤمن في العادة تواطؤهم على الكذب. ولا يشترط أن يكونوا ذكوراً أحراراً عدولاً.\n" +
                "\n" +
                "      2- أن يراه عَدْلان فأكثر: فيثبت بهما الصوم والفطر في حالة الغيم أو الصحو. والعدل: هو الذكر الحر البالغ العاقل الذي لم يرتكب معصية كبيرة ولم يصر على معصية صغيرة، ولم يفعل ما يخل بالمروءة.\n" +
                "\n" +
                "      فلا يجب الصوم في حالة الغيم برؤية عدل واحد أو امرأة أو امرأتين على المشهور، ويجب الصوم قطعاً على الرائي في حق نفسه.\n" +
                "\n" +
                "      وتجوز الشهادة بناء على شهادة العدلين إذا نقل الخبر عن كل واحد اثنان، ولا يكفي نقل واحد.\n" +
                "\n" +
                "      ولا يشترط في إخبار العدلين أو غيرهم لفظ \"أشهد\".\n" +
                "\n" +
                "      3- أن يراه شاهد واحد عدل: فيثبت الصوم والفطر له في حق العمل بنفسه أو في حق من أخبره ممن لا يعتني بأمر الهلال، ولا يجب على من يعتني بأمر الهلال الصوم برؤيته، ولا يجوز الإفطار بها، فلا يجوز للحاكم أن يحكم بثبوت الهلال برؤية عدل فقط.\n" +
                "\n" +
                "      ولا يشترط في الواحد الذكورة ولا الحرية. فإن كان الإمام هو الرائي وجب الصوم والإفطار.\n" +
                "\n" +
                "      ويجب على العدل أو العدلين رفع الأمر للحاكم أنه رأى الهلال ليفتح باب الشهادة، ولأنه قد يكون الحاكم ممن يرى الثبوت بعدل.\n" +
                "\n" +
                "      أما هلال شوال: فيثبت برؤية الجماعة الكثيرة التي يؤمن تواطؤها على الكذب ويفيد خبرها العلم أو برؤية العدلين كما هو الشأن في إثبات هلال رمضان.\n" +
                "\n" +
                "      ولا يثبت الهلال بقول منجّم أي حاسب يحسب سير القمر، لا في حق نفسه ولا غيره، لأن الشارع أناط الصوم والفطر والحج برؤية الهلال، لا بوجوده إن فرض صحة قوله، فالعمل بالمراصد الفلكية وإن كانت صحيحة لا يجوز.\n" +
                "\n" +
                "      وذهب الشافعية إلى أنه تثبت رؤية الهلال لرمضان أو شوال أو غيرهما بالنسبة إلى عموم الناس برؤية شخص عدل، ولو مستور الحال، سواء أكانت السماء مصحية أم لا، بشرط أن يكون الرائي عدلاً مسلماً بالغاً عاقلاً حراً ذكراً، وأن يأتي بلفظ \"أشهد\" فلا تثبت برؤية الفاسق والصبي والمجنون والعبد والمرأة. ودليلهم: أن ابن عمر رضي الله تعالى عنهما رأى الهلال، فأخبر رسول الله صلى الله عليه وسلم بذلك، فصام وأمر الناس بصيامه. رواه أبو داود. وعن ابن عباس رضي الله عنهما، قال: \"جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال: إني رأيت هلال رمضان، فقال: أتشهد أن لا إله إلا الله؟ قال: نعم، قال: تشهد أن محمداً رسول الله؟ قال: نعم، قال: يا بلال، أذن في الناس، فليصوموا غداً\" رواه أبو داود والترمذي والمعنى في ثبوته بالواحد الاحتياط للصوم.\n" +
                "\n" +
                "      أما الرائي نفسه فيجب عليه الصوم، ولو لم يكن عدلاً (أي فاسقاً) أو كان صبياً أو امرأة أو كافراً، أو لم يشهد عند القاضي، أو شهد ولم تسمع شهادته، كما يجب الصوم على من صدقه ووثق بشهادته.\n" +
                "\n" +
                "      وإذا صمنا برؤية عدل، ولم نر الهلال بعد ثلاثين، أفطرنا في الأصح، وإن كانت السماء صحواً، لكمال العدد بحجة شرعية.\n" +
                "\n" +
                "      وذهب الحنابلة: إلى أنه يقبل في إثبات هلال رمضان قول مكلف عدل واحد ظاهراً وباطناً ذكراً أو أنثى حراً أو عبداً، ولو لم يقل: أشهد أو شهدت أني رأيته، فلا يقبل قول مميز ولا مستور الحال لعدم الثقة بقوله في الغيم والصحو، ولو كان الرائي في جمع كثير ولم يره منهم غيره.\n" +
                "\n" +
                "      ودليلهم الحديث المتقدم أنه صلى الله عليه وسلم صوَّم الناس بقول ابن عمر، ولقبوله خبر الأعرابي السابق به، ولأنه خبر ديني وهو أحوط، ولا تهمة فيه، بخلاف آخر الشهر، ولاختلاف حال الرائي والمرئي، فلو حكم حاكم بشهادة واحد، عمل بها وجوباً. ولا يعتبر لوجوب الصوم لفظ الشهادة، ولا يختص بحاكم، فيلزم الصوم من سمعه من عدل. ولا يجب على من رأى الهلال إخبار الناس أو أن يذهب إلى القاضي أو إلى المسجد. ويجب الصوم على من ردت شهادته لفسق أو غيره، لعموم الحديث: \"صوموا لرؤيته\" ولا يفطر إلا مع الناس، لأن الفطر لا يباح إلا بشهادة عدلين. وإن رأى هلال شوال وحده لم يفطر لحديث أبي هريرة يرفعه قال: \"الفطر يوم يفطرون، والأضحى يوم يضحون\". رواه الترمذي. ولاحتمال خطئه وتهمته، فوجب الاحتياط. وتثبت بقية الأحكام إذا ثبتت رؤية هلال رمضان بواحد من وقوع الطلاق المعلق به، وحلول آجال الديون المؤجلة إليه، وغيرها كانقضاء العدة والخيار المشروط ومدة الإيلاء ونحوها تبعاً للصوم.\n" +
                "\n" +
                "      ولا يجب الصوم بالحساب والنجوم ولو كثرت إصابتهما، لعدم استناده لما يعول عليه شرعاً.\n" +
                "\n" +
                "      ولا يقبل في إثبات بقية الشهور كشوال (من أجل العيد) وغيره إلا رجلان عدلان، بلفظ الشهادة، لأن ذلك مما يطلع عليه الرجال غالباً، وليس بمال ولا يقصد به المال. وإنما ترك ذلك في إثبات رمضان احتياطاً للعبادة.\n" +
                "\n" +
                "      وإذا صام الناس بشهادة اثنين: ثلاثين يوماً، فلم يروا الهلال، أفطروا، سواء في حال الغيم أو الصحو، لحديث عبد الرحمن بن زيد بن الخطاب أن النبي صلى الله عليه وسلم قال: \"وإن شهد شاهدان فصوموا وأفطروا\". رواه النسائي.\n" +
                "\n" +
                "      ولا يفطروا إن صاموا الثلاثين يوماً بشهادة واحد، لأنه فطر، فلا يجوز أن يستند إلى واحد، كما لو شهد بهلال شوال.\n" +
                "\n" +
                "      وإن صاموا ثمانية وعشرين يوماً، ثم رأوا الهلال، قضوا يوماً فقط. وإن صاموا لأجل غيم ونحوه كدخان، لم يفطروا، لأن الصوم إنما كان احتياطاً، فمع موافقته للأصل : وهو بقاء رمضان، أولى. وإن رأى هلال شوال عدلان، ولم يشهدا عند الحاكم، جاز لم سمع شهادتهما الفطر إذا عرف عدالتهما، وجاز لكل واحد منهما أن يفطر بقولهما إذا عرف عدالة الآخر، لقوله صلى الله عليه وسلم: \"فإن شهد شاهدان فصوموا وأفطروا\" فإن لم يعرف أحدهما عدالة الآخر، لم يجز له الفطر لاحتمال فسقه إلا أن يحكم بذلك حاكم، فيزول اللبس.\n" +
                "\n" +
                "      وإن شهد شاهدان عند الحاكم برؤية هلال شوال : فإن رد الحاكم شهادتهما، لجهله بحالهما، فلمن علم عدالتهما الفطر، لأن رده ههنا ليس بحكم منه بعدم قبول شهادتهما، إنما هو توقف لعدم علمه بحالهما، فهو كالتوقف عن الحكم انتظاراً للبينة، فلو ثبتت عدالتهما بعد ذلك ممن زكاهما حكم بها، لوجود المقتضي، وأما إن رد الحاكم شهادتهما لفسقهما، فليس لهما ولا لغيرهما الفطر بشهادتهما.\n" +
                "\n" +
                "      وإذا اشتبهت الأشهر على أسير أو سجين أو من بمفازة أو بدار حرب ونحوهم، اجتهد وتحرى في معرفة شهر رمضان وجوباً، لأنه أمكنه تأدية فرضه بالاجتهاد، فلزمه كاستقبال القبلة، فإن وافق ذلك شهر رمضان أو ما بعد رمضان، أجزأه.\n" +
                "\n" +
                "      وإن تبين أن الشهر الذي صامه ناقص، ورمضان الذي فاته كامل تمام، لزمه قضاء النقص، لأن القضاء يجب أن يكون بعدد المتروك. وإن وافق صومه شهراً قبل رمضان كشعبان لم يجزه، لأنه أتى بالعبادة قبل وقتها، فلم يجزه، كالصلاة، فلو وافق بعضه رمضان، فما وافقه أو بعده، أجزأه، دون ما قبله.\n" +
                "\n" +
                "      وإن صام من اشتبهت عليه الأشهر، بلا اجتهاد، فكمن خفيت عليه القبلة، لا يجزيه مع القدرة على الاجتهاد.\n" +
                "\n" +
                "      - والخلاصة: أن الحنفية يشترطون لإثبات هلال رمضان وشوال رؤية جمع عظيم إذا كانت السماء صحواً، وتكفي رؤية العدل الواحد في حال الغيم ونحوه. ولابد عند المالكية من رؤية عدلين أو أكثر، وتكفي رؤية العدل الواحد عندهم في حق من لا يهتم بأمر الهلال.\n" +
                "\n" +
                "      وتكفي رؤية عدل واحد عند الشافعية والحنابلة، ولو مستور الحال عند الشافعية، ولا يكفي المستور عند الحنابلة، كما لا بد عند الحنابلة من رؤية هلال شوال من عدلين لإثبات العيد.\n" +
                "\n" +
                "      - وتقبل شهادة المرأة عند الحنفية والحنابلة، ولا تقبل عند المالكية والشافعية."
    ),
    ExploreData.DetailSoumData(
        title = "طلب رؤية الهلال",
        description = "وذهب الحنفية: إلى أنه يجب للناس أن يلتمسوا الهلال في اليوم التاسع والعشرين من شعبان، وكذا هلال شوال لأجل إكمال العدة، فإن رأوه صاموا، وإن غم عليهم، أكملوا عدة شعبان ثلاثين يوماً، ثم صاموا، لأن الأصل بقاء الشهر، فلا ينتقل عنه إلا بدليل، ولم يوجد.\n" +
                "\n" +
                "      وذهب الحنابلة: إلى أنه يستحب ترائي الهلال احتياطاً للصوم، وحذاراً من الاختلاف.\n" +
                "\n" +
                "      قالت عائشة: \"كان النبي صلى الله عليه وسلم يتحفظ في شعبان ما لا يتحفظ في غيره، ثم يصوم لرؤية رمضان\" رواه الدارقطني وروى أبو هريرة مرفوعاً: \"أحصوا هلال شعبان لرمضان\". رواه الترمذي.\n" +
                "\n" +
                "      ويسن إذا رأى المرء الهلال كبَّر ثلاثاً، وقال: \"اللهم أهلّه علينا باليُمن والإيمان، والأمن والأمان، ربي وربك الله\" ويقول ثلاث مرات: \"هلال خير ورشد\" ويقول: \"آمنت بالذي خلقك\" ثم يقول: \"الحمد لله الذي ذهب بشهر كذا، وجاء بشهر كذا\" وروى الأثرم عن ابن عمر، قال: \"كان النبي صلى الله عليه وسلم إذا رأى الهلال قال: الله أكبر، اللهم أهلّه علينا بالأمن والإيمان، والسلامة والإسلام، والتوفيق لما تحب وترضى، ربي وربك الله\".\n" +
                "\n" +
                "      وإذا رئي الهلال يكره عند الحنفية أن يشير الناس إليه، لأنه من عمل الجاهلية."
    ),
    ExploreData.DetailSoumData(
        title = "اختلاف المطالع",
        description = "اختلف الفقهاء على قولين في وجوب الصوم وعدم وجوبه على جميع المسلمين في المشارق والمغارب في وقت واحد، بحسب القول باتفاق مطالع القمر أو اختلاف المطالع.\n" +
                "\n" +
                "      ذهب الجمهور -الحنفية والمالكية والحنبلية- إلى أنه يوحد الصوم بين المسلمين، ولا عبرة باختلاف المطالع.\n" +
                "\n" +
                "      وذهب الشافعية إلى أنه يختلف بدء الصوم والعيد بحسب اختلاف مطالع القمر بين مسافات بعيدة.\n" +
                "\n" +
                "      هذا مع العلم بأن نفس اختلاف المطالع لا نزاع فيه، فهو أمر واقع بين البلاد البعيدة كاختلاف مطالع الشمس، ولا خلاف في أن للإمام الأمر بالصوم بما ثبت لديه، لأن حكم الحاكم يرفع الخلاف، وأجمعوا أنه لا يراعى ذلك في البلدان النائية جداً كالأندلس والحجاز، وأندونيسيا والمغرب العربي.\n" +
                "\n" +
                "      تفصيل آراء المذاهب في ذلك:\n" +
                "\n" +
                "      قال الحنفية: اختلاف المطالع، ورؤية الهلال نهاراً قبل الزوال وبعده غير معتبر، فيلزم أهل المشرق برؤية أهل المغرب، إذا ثبت عندهم رؤية أولئك، بطريق موجب، كأن يتحمل اثنان الشهادة، أو يشهدا على حكم القاضي، أو يستفيض الخبر، بخلاف ما إذا أخبر أن أهل بلدة كذا رأوه، لأنه حكاية.\n" +
                "\n" +
                "      وقال المالكية: إذا رئي الهلال، عمَّ الصوم سائر البلاد، قريباً أو بعيداً، ولا يراعى في ذلك مسافة قصر، ولا اتفاق المطالع، ولا عدمهما، فيجب الصوم على كل ما منقول إليه، إن نقل ثبوته بشهادة عدلين أو بجماعة مستفيضة، أي منتشرة.\n" +
                "\n" +
                "      وقال الحنابلة: إذا ثبتت رؤية الهلال بمكان، قريباً كان أو بعيداً، لزم الناس كلهم الصوم، وحكم من لم يره حكم من رآه.\n" +
                "\n" +
                "      وقال الشافعية: إذا رئي الهلال ببلد لزم حكمه البلد القريب لا البعيد بحسب اختلاف المطالع، واختلاف المطالع لا يكون في أقل من أربعة وعشرين فرسخاً.\n" +
                "\n" +
                "      وإذا لم نوجب على البلد الآخر وهو البعيد، فسافر إليه من بلد الرؤية من صام به، فالأصح أنه يوافقهم وجوباً في الصوم آخراً، وإن كان قد أتم ثلاثين، لأنه بالانتقال إلى بلدهم، صار واحداً منهم، فيلزمه حكمهم.\n" +
                "\n" +
                "      ومن سافر من البلد الآخر الذي لم ير فيه الهلال إلى بلد الرؤية، عيَّد معهم وجوباً، لأنه صار واحداً منهم، سواء أصام ثمانية وعشرين يوماً، أم تسعة وعشرين بأن كان رمضان تاماً عندهم، وقضى يوماً إن صام ثمانية وعشرين، لأن الشهر لا يكون كذلك.\n" +
                "\n" +
                "      ومن أصبح مُعَيِّداً، فسارت سفينته أو طائرته إلى بلدة بعيدة أهلها صيام، فالأصح أنه يمسك بقية اليوم وجوباً، لأنه صار واحداً منهم.\n" +
                "\n" +
                "      ورأي الجمهور هو الأرجح توحيداً للعبادة بين المسلمين، ومنعاً من الاختلاف غير المقبول في عصرنا، ولأن إيجاب الصوم معلق بالرؤية، دون تفرقة بين الأقطار."
    ),
    ExploreData.DetailSoumData(
        title = "شروط وجوب الصوم",
        description = "أي: اشتغال الذمة بالواجب هي شروط افتراضه والخطاب به. وهي:\n" +
                "\n" +
                "      أ- الإسلام، وهو شرط عام للخطاب بفروع الشريعة.\n" +
                "\n" +
                "      ب- العقل، إذ لا فائدة من توجه الخطاب بدونه، فلا يجب الصوم على مجنون إلا إذا أثم بزوال عقله، في شراب أو غيره، ويلزمه قضاؤه بعد الإفاقة.\n" +
                "\n" +
                "      وعبر الحنفية بالإفاقة بدلاً من العقل، أي الإفاقة من الجنون والإغماء أو النوم، وهي اليقظة.\n" +
                "\n" +
                "      ج- البلوغ، ولا تكليف إلا به، لأن الغرض من التكليف هو الامتثال، وذلك بالإدراك والقدرة على الفعل -كما هو معلوم في الأصول- والصبا والطفولة عجز.\n" +
                "\n" +
                "      ونص الفقهاء على أنه يؤمر به الصبي لسبع -كالصلاة- إن أطاقه، ويضرب على تركه لعشر.\n" +
                "\n" +
                "      والحنابلة قالوا: يجب على وليهّ أمرُه بالصوم إذا أطاقه، وضربه حينئذ إذا تركه ليعتاده، كالصلاة، إلا أن الصوم أشق، فاعتبرت له الطاقة، لأنه قد يطيق الصلاة من لا يطيق الصوم.\n" +
                "\n" +
                "      د- العلم بالوجوب، فمن أسلم في دار الحرب، يحصل له العلم الموجب، بإخبار رجلين عدلين، أو رجل مستور وامرأتين مستورتين، أو واحد عدل، ومن كان مقيماً في دار الإسلام، يحصل له العلم بنشأته في دار الإسلام، ولا عذر له بالجهل."
    ),
    ExploreData.DetailSoumData(
        title = "شروط صحة الصوم",
        description = "شرط صحة الصوم هي:\n" +
                "\n" +
                "      أ- الطهارة من الحيض والنفاس.\n" +
                "\n" +
                "      ب- خلّوه عما يفسد الصوم بطروّه عليه كالجماع.\n" +
                "\n" +
                "      ج- النية. وذلك لأن صوم رمضان عبادة، فلا يجوز إلا بالنية، كسائر العبادات. ولحديث: \"إنما الأعمال بالنيات\" متفق عليه.\n" +
                "\n" +
                "      والإمساك قد يكون للعادة، أو لعدم الاشتهاء، أو للمرض، أو للرياضة، فلا يتعين إلا بالنية، كالقيام إلى الصلاة والحج. ولا يصح الصوم إلا بنية، ومحلها القلب، ولا يشترط النطق بها، بلا خلاف."
    )
)

val detailHajjData = listOf(
    ExploreData.DetailHajjData(
        title = "أركان الحج",
        description = "للحج أركان لا يصح ولا يتم إلا بهن وهم:\n" +
                "\n" +
                "الإحرام.\n" +
                "طواف الإفاضة.\n" +
                "الوقوف بعرفة.\n" +
                "السعي بين الصفا والمروة."
    ),
    ExploreData.DetailHajjData(
        title = "واجبات الحج",
        description = "الإحرام من الميقات.\n" +
                "الوقوف بعرفة إلى غروب الشمس لمن وقف نهارًا.\n" +
                "المبيت بمزدلفة إلى الفجر، إلا الضعفاء ومن له عذر إلى منتصف الليل.\n" +
                "الحلق أو التقصير بعد رمي جمرة العقبة.\n" +
                "المبيت بمني ليالي أيام التشريق.\n" +
                "رمي الجمرات أيام التشريق.\n" +
                "طواف الوداع.\n" +
                "من ترك واجبًا من واجبات الحج فعليه ذبح شاة توزع على فقراء الحرم."
    ),
    ExploreData.DetailHajjData(
        title = "محظورات الإحرام وفديتها",
        description = "إزالة الشعر بقص أو حلق أو قطع أو نتف\n" +
                "وفديته: ذبح شاة وهي من الأبقار أو الماعز أو الخرفان وغيرها، أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "تقليم الأظفار\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "تغطية الرأس للرجال دون النساء\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "لبس المخيط للرجال دون النساء\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "مس الطيب\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "قتل الصيد البري واصطياده\n" +
                "وفديته: ذبح ما يماثله من بهيمة الأنعام، أو إطعام مساكين بقيمة البهيمة، او الصوم أيام بعدد المساكين الذين يمكن إطعامهم بقيمة البهيمة.\n" +
                "\n" +
                "عقد النكاح أو الخطبة، وهذا ليس عليه فدية بل عليه توبة.\n" +
                "المباشرة فيما دون الفرج.\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام.\n" +
                "\n" +
                "الجماع، يفسد الحج، ويمضي فيه، ويقضي في العام القادم، ويذبح بدنة.\n" +
                "لبس النقاب والقفازين للنساء، إلا إذا مر الرجال غير المحارم فيجب ان تغطي وجهها.\n" +
                "وفديته: ذبح شاة أو إطعام ستة مساكين، نصف صاع لكل مسكين، أو صوم ثلاثة أيام."
    ),
    ExploreData.DetailHajjData(
        title = "ماذا يفعل الحاج إذا وقع في شيء محظور؟",
        description = "إذا وقع الحاج في شيء من هذه المحظورات فإنه لا يخلو من أحوال:\n" +
                "\n" +
                "أن يفعله ناسيًا، أو جاهلًا، أو نائمًا، فلا شيء عليه.\n" +
                "أن يفعله عمدًا، ولكن لعذر يبيح فعل المحظور، فلا إثم عليه، ويلزمه فدية ذلك المحظور.\n" +
                "أن يفعله عمدًا بلا عذر فهو أثم، ويلزمه فدية ذلك المحظور"
    ),
    ExploreData.DetailHajjData(
        title = "شرح مناسك الحج",
        description = "1- الإحرام ومواقيت الإحرام\n" +
                "إن النبي وقت لأهل جميع النواحي المواقيت الخمسة المعلومة، ففي الصحيحين عن ابن عباس رضي الله عنهما، قال: وقت النبي لأهل المدينة ذا الحليفة، ولأهل الشام الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم.\n" +
                "في رواية السيدة عائشة: للعراق ذات عرق، هذه خمسة مواقيت قال عنها النبي في حديث ابن عباس رضي الله عنهما: (هن لهن ولمن أتى عليهن من غير أهلهن ممن أراد الحج والعمرة ومن كان دون ذلك فمهله من حيث أنشأ حتى أهل مكة من مكة) رواه البخاري.\n" +
                "2- النسك وانواعه\n" +
                "التمتع: أن يحرم بالعمرة في أشهر الحج شوال وذي القعدة وأول ثمانية أيام من شهر ذي الحجة، ثم يتحلل من إحرامه بعد أداء العمرة، ويتمتع بحياته العادية حتى اليوم الثامن من ذي الحجة، فينوي الحج من مكانه بمكة، ويلبس ملابس الإحرام، ويأتي بمناسك الحج، وعليه هدي التمتع.\n" +
                "القران: ينوي فيه الحاج نية الإتيان بحج وعمرة معًا في ان واحد وبأفعال واحدة، أو يحرم بالعمرة أولًا ثم يدخل الحج عليها قبل الشروع في طوافها، وفيه الهدي.\n" +
                "الإفراد: ينوي فيه الحاج نية الحج فقط، ولا هدي فيه.\n" +
                "الفرق بين القارن والمفرد\n" +
                "هناك فرق بين القارن والمفرد في أمرين:\n" +
                "\n" +
                "أن المفرد حين الإهلال يقول: لبيك حجًا، والقارن يقول: لبيك عمرة وحجًا.\n" +
                "\n" +
                "المفرد ليس عليه هدي، بينما القارن عليه هدي كالمتمتع.\n" +
                "\n" +
                "3- يوم التروية (اليوم 8 من ذي الحجة)\n" +
                "الإحرام بنية الدخول في النسك، ويستحب الاغتسال والتنظف، والتطيب للرجال قبل الدخول في النسك، ولبس ملابس الإحرام.\n" +
                "الرجل يلبس إزارًا ورداءً أبيضين والنعلين ولا يلبس الخفين أما النساء فتلبس ما شاءت ليس فيه تبرج ولا تشيه بالرجال، وتتجنب لبس النقاب والقفازين، وتستر وجهها عن الرجال الأجانب.\n" +
                "يستحب للمتمتع الإحرام بالحج من مكانه الذي هو نازل فيه فيقول: (اللهم لبيك حاجًا)، وأما المفرد والمقرن فيجب الإحرام من الميقات.\n" +
                "تستحب التلبية بعد الدخول في النسك والإكثار منها، ورفع الصوت بها للرجال فقط دون النساء، إلى أن يرمي جمرة العقبة في اليوم العاشر.\n" +
                "ينزل إلى منى ويقصر الصلاة الرباعية ركعتين من غير جمع.\n" +
                "من خالف شيئًا مما سبق ذكره فلا شيء عليه.\n" +
                "4- يوم عرفة (اليوم 9 من ذي الحجة)\n" +
                "يستحب الذهاب إلى عرفة بعد طلوع الشمس مع التلبية.\n" +
                "يستحب أن يستمع إلى الخطبة ثم أداء صلاة الظهر والعصر جمعًا وقصرًا بأذان واحد وإقامتين.\n" +
                "يستحب أن يتفرغ الحاج للدعاء بخشوع وحضور قلب مع استقبال القبلة ورفع اليدين.\n" +
                "يجب الوقوف بعرفة حتى غروب الشمس.\n" +
                "الإكثار من قول: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.\n" +
                "من لم يقف بعرفة فلا حج له، ومن دفع منها قبل الغروب فعليه دم.\n" +
                "يجوز الوقوف في أي مكان من عرفة إلا (بطن عرنة) لقول الرسول صلى الله عليه وسلم: (كل عرفة موقف، وارتفعوا عن بطن عرنة).\n" +
                "مكروه صوم يوم عرفة للحاج، إلا لمن لم يجد الهدي.\n" +
                "5- ليلة المزدلفة\n" +
                "يستحب بعد غروب يوم عرفة الذهاب إلى مزدلفة بهدوء وسكينة وبلا مزاحمة ويكثر من التلبية في الطريق.\n" +
                "يستحب أداء صلاة المغرب 3 ركعات وصلاة العشاء ركعتين جمعًا وقصرًا بأذان واحد وإقامتين فور الوصول إلى مزدلفة.\n" +
                "يجب المبيت بمزلفة إلى منتصف الليل وإلا عليه دم، والسنة أن يقف حتى طلوع الفجر ثم الجلوس بعد أداء صلاة الفجر.\n" +
                "يجوز أن ينفر الضعفاء والعجزة والنساء ومن يقوم عليهم بعد منتصف الليل.\n" +
                "إذا وصل إلى وادي محسر، يسن الإسراع فيه لأنه موضع عذاب، إذ تحسر فيه أبرهة الحبشي حين جاء لهدم الكعبة.\n" +
                "6- يوم النحر (اليوم 10 من ذي الحجة)\n" +
                "يأتي الحاج إلى منى قبل طلوع الشمس مع الإكثار من التلبية وذكر الله.\n" +
                "يستحب جمع سبع حصيات من مزدلفة او من منى حسب المتيسر.\n" +
                "يتجه الحاج إلى جمرة العقبة ويجب رميها بسبع حصيات فإن ترك فعليه دم.\n" +
                "يستحب أن يرمي كل حصاة متعاقبات قائلًا (الله أكبر) ويجعل مكة عن يساره ومنى عن يمينه، ويجب وقوع الحصاة في الحوض وإلا لم يجزئ.\n" +
                "يقطع التلبية من حين البدء بالرمي، ويشرع في التكبير المقيد (الله أكبر الله أكبر الله أكبر كبيرا)، ولا يشرع في الدعاء بعد الرمي.\n" +
                "يجب نحر الهدي على المتمتع ويبدأ وقته من يوم العيد وينتهي بغروب شمس اليوم الثالث عشر من أيام الحج مع جواز الذبح ليلًا.\n" +
                "من لم يجد الهدي فعليه صيام ثلاثة أيام في الحج وسبعة أيام إذا رجع إلى بلده.\n" +
                "يجب الحلق أو التقصير، والحلق أفضل، والمرأة تأخذ من شعرها بقدر أنملة، وإن لم يحلق أو يقصر فعليه دم.\n" +
                "يجب أداء الطواف (الإفاضة) ولا يصح الحج بدونه، ولا يرمل ولا يضطبع، ويجوز تأخيره عند سفره، ويجزئ عن طواف الوداع.\n" +
                "7- يوم النحر (اليوم 10 من ذي الحجة)\n" +
                "يجب اداء السعي، فإن تركه لا يصح حجه، لأنه ركن من أركان الحج.\n" +
                "يبيت في منى والمقدار الواجب هو أكثر من نصف الليل، فإن تركه فعليه دم.\n" +
                "يستحب أداء الصلوات في منى وأن يقصر الرباعية من غير جمع.\n" +
                "يستحب التكبير بعد الصلوات المفروضة بأي صفة من الصفات الواردة (الله أكبر الله أكبر الله أكبر لا إله إلا الله والله أكبر ولله الحمد).\n" +
                "8- أيام التشريق (أيام 11 و12 و13 من ذي الحجة)\n" +
                "يجب رمي الجمرات الثلاثة بعد الزوال حتى طلوع الفجر، بدءً بالصغرى ثم الوسطى ثم الكبرى (العقبة)، فإن ترك فعليه دم.\n" +
                "يستحب بعد رمي الجمرة الصغرى أن يتقدم قليلًا في مكان لا يصيب فيه الرمي ويستقبل القبلة ويدعو دعاءً طويلًا رافعًا يديه، ويفعل مثله بعد رمي الجمرة الوسطى وبعد رمي جمر العقبة (الكبرى) لا يشرع الدعاء.\n" +
                "يستحب البقاء إلى اليوم الثالث عشر، ويجوز التعجل والخروج في اليوم الثاني عشر، ولكن يجب الخروج من منى قبل غروب شمس يوم 12 ذي الحجة.\n" +
                "أذا غربت الشمس ولم يخرج من منى فيلزمه التأخر ويكمل أعماله في اليوم الثالث عشر من ذي الحجة.\n" +
                "يجب أداء طواف الوداع إلا على الحائض والنفساء، فإن ترك فعليه دم."
    ),
)

val detailZakahData = listOf(
    ExploreData.DetailZakahData(
        title = "شروط الزكاة",
        description = "الإسلام: لا تجب الزكاة إلا على المسلم، فهي لا تقبل من الكافر.\n" +
                "الحرية: لا تجب الزكاة على العبد، لأنه لا يملك شيئاً.\n" +
                "الحلال: لابد أن يكون المال حلالاً.\n" +
                "الملك التام: أن يكون المال مملوكاً لصاحبه بأكمله مُلكاً تاماً.\n" +
                "النماء: أن يكون المال في نماء أو يكون قابلاً للزيادة، كالأنعام التي تتوالد والزروع التي تثمر.\n" +
                "الحول: أن يمر سنة هجرية كاملة على اِمتلاك المال. ويكون هذا الشرط في جميع أنواع الأموال الزكوية، عدا عن الزروع والثمار فتجب عند الحصاد.\n" +
                "الفائض عن الحوائج الأصلية: أن يكون من المال الفائض عن الحاجات الأصلية والضرورية كالمأكل والمشرب والملبس والسكن وكل ما هو ضروري للعيش.\n" +
                "النصاب: ملك وبلوغ النصاب، ويختلف حسب نوع المال الزكوي.\n" +
                "أن لا يكون على المال دين."
    ),
    ExploreData.DetailZakahData(
        title = "نصاب الزكاة",
        description = "النصاب هو قيمة الحد الأدنى الذي إذا مرَّ عليه عام كامل، وهي عند المسلم ولم تنقص، وجب إخراج زكاة عنها، وهو يختلف باِختلاف أنواع المال:\n" +
                "\n" +
                "يبلغ نِصاب الذهب عشرين مثقالاً، ولا تجب الزكاة في أقلّ من ذلك؛ اِستدلالاً بما ورد عن أمّ المؤمنين السيّدة عائشة -رضي الله عنها- أنّ النبيّ -عليه الصلاة والسلام-: (كانَ يأخذُ من كلِّ عشرينَ ديناراً فصاعداً نِصفَ دينارٍ ومنَ الأربعينَ ديناراً ديناراً).\n" +
                "ويبلغ نِصاب الفضّة خمسَمئةٍ وخمسة وتسعين غراماً من الفضّة الخالصة، وهي ما تُعرَف بالفضّة ذات عيار ألفٍ.\n" +
                "أما زكاة الأوراق النقديّة، يتمّ تحديده قِياساً على سِعر الذهب أو الفضّة؛ إذ يتمّ إجراء عملية الضرب الحسابيّة بين نِصاب الذهب، وسِعره، فإن كان نِصاب الذهب يبلغ خمسة وثمانين غراماً، مع فَرْض أنّ سِعر غرام الذهب يبلغ خمسة وثلاثين ديناراً مثلاً، فإنّ نِصاب الأوراق النقديّة يُساوي ألفَين وتسعمئةٍ وخمسة وسبعين ديناراً.\n" +
                "نِصاب عروض التجارة، يُقاس على نِصاب الذهب أو الفضّة؛ فإن اِمتلكَ المسلم بضاعةً، وقُدِّر ثمنها بالعملة المَحلّية، وكانت قيمتها مُساويةً لثمن خمسةٍ وثمانين غراماً من الذهب، فقد وجبَت فيها الزكاة."
    ),
    ExploreData.DetailZakahData(
        title = "مقدار دفع الزكاة",
        description = "الزكاة هي فريضة على كل مسلم عاقل قادر مكلَّف، نصابها المعلوم هو 2.5% من إجمالي المملوكات والثروة إذا مرَّ عليها عام. وطريقة حساب الزكاة للأوراق النقدية: أن تخرج من كل ألف منها 25، فإذا كانت عشرة آلاف فإن زكاتها= 250."
    ),
    ExploreData.DetailZakahData(
        title = "تاريخ استحقاق دفع الزكاة – الحول",
        description = "يجب إخراج زكاة المال بعد مرور حول قمري كامل من بلوغ النصاب، فإذا اكتمل العام في أول الشهر وجب إخراجها في أوله، وإذا لم يكتمل إلا في وسطه أو آخره لم يجب إخراجها قبل ذلك."
    ),
    ExploreData.DetailZakahData(
        title = "أنواع الزكاة",
        description = "هناك عدد من أنواع الزكاة التي يجب على المسلم إخراج الزكاة فيها، وهي: \n" +
                "\n" +
                "زكاة المال\n" +
                "يجب إخراج الزكاة على النقود سواء كانت هذه النقود مسبوكةً، أو مضروبةً. وتتم عن طريق تقسيم مجموع المبلغ المراد إخراج زكاته على 40، لنفترض أن المبلغ المراد إخراج الزكاة منه هو 100.000 دولار، تحسب الزكاة كالآتي: 100.000/40 = 2500 دولار.\n" +
                "\n" +
                "زكاة الذهب\n" +
                "إن الذهب والفضة من أنواع الزكاة التي أمرنا الله تعالى بها، ومن الشروط التي تجب عندها الزكاة في الذهب والفضة:\n" +
                "\n" +
                "أن يبلغ النصاب وهو ما يساوي 85 جراماً من الذهب الخالص عيار 24 ,فلو كان أقل من ذلك فلا تجب زكاته حتى نعيده إلى أصله.\n" +
                "أن يحول عليه الحول وهي سنة قمرية كاملة.\n" +
                "الملكية التامة، وأن تعود لمسلم حر.\n" +
                "زكاة الزرع والثمار\n" +
                "أن النصاب التي تجب فيها الزكاة من الثمار والزروع هو خمسة أوسق بمعيار الكيل، والوسق الواحد ستون صاعاً، والصاع يساوي كيلوين وأربعين جراماً من البر الجيد، فالإناء الذي يمتلئ بهذا القدر من البر هو الصاع، فالنصاب إذاً ثلاثمائة صاع، والقدر الذي يجب إخراجه هو نصف العشر، إن كان السقي بكلفة، وإن كان بغير كلفة كالسقي بماء المطر، فيجب إخراج العشر أي عشر المحصول إذا بلغ النصاب.\n" +
                "\n" +
                "لإخراج زكاة الثمار يجب أن تتوفر فيها شروط الزكاة:\n" +
                "\n" +
                "أن تكون خارجة من أرض صاحب الزكاة.\n" +
                "أن تبلغ النصاب، ومقداره خمسة أوسق، وهي ما تعادل (612) كيلوغرام تقريباً.\n" +
                "زكاة الأصول\n" +
                "تشمل الأصول المستغلة أي شيء مؤجر من أجل الربح، مثل المباني السكنية أو المعدات أو وسائل النقل. وتشمل أيضاً الحيوانات المنتجة مثل الأغنام للصوف، أو أبقار للحليب، أو نحل للعسل. أما الأصول السائلة هي سلع يمكن بيعها بسهولة، لتحقيق الربح عادة. تجب الزكاة مرة واحدة فقط في السنة الزكوية، وتناسب جميع شروط الزكاة الأخرى من أي أموال أخرى تجب عليها الزكاة.\n" +
                "\n" +
                "زكاة الأسهم والاستثمار\n" +
                "السهم عبارة عن جزء من رأس مال الشركة، وصاحب السهم يُعد شريكاً في الشركة, أي مالكاً لجزء من أموالها بنسبة عدد أسهمه إلى مجموع أسهم الشركة. ولذلك إذا اتخذ أسهمه للمتاجرة بها بيعاً وشراءً فالزكاة الواجبة فيها هي ربع العشر(2.5%) من القيمة السوقية يوم وجوب الزكاة, كسائر عروض التجارة.\n" +
                "\n" +
                "زكاة المعاش والأموال المدخرة\n" +
                "تجب الزكاة في حالة بلغ المال المدخر من الراتب النصاب، وحال عليه الحول. وأما المال المدخر المودع في البنك إذا بلغ النصاب ومقداره ما يعادل قيمته 85 جراماً من الذهب، ومر على هذا المال سنة هجرية -قمرية- فتخرج زكاة المال بواقع 2.5%."
    ),
    ExploreData.DetailZakahData(
        title = "مستحقي الزكاة",
        description = "قد فرض الله -تعالى- الزكاة على الأغنياء، وأمرهم بدفعها بعد حسابها إلى ثمانيّة أصناف في القرآن الكريم. قال الله تعالى: {إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ فَرِيضَةً مِنَ اللَّهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ}.\n" +
                "\n" +
                "الفقراء: هم الذين لا يجدون كفايتهم.\n" +
                "المساكين: الأشخاص الذين يملكون من المال القليل.\n" +
                "العاملون عليها: هم الذين يوظّفهم الحاكم، للقيام بجمع أموال الزّكاة، وتوزيعها لمُستحقّيها.\n" +
                "المؤلفة قلوبهم: هم المراد تأليف قلوبهم على الإسلام أو تثبيتها عليه لضعف إسلامهم.\n" +
                "الرقاب: هم الأرقاء والعبيد.\n" +
                "الغارمين:  هم الذين تحملوا الديون وتعذّر عليهم أداؤها.\n" +
                "في سبيل الله: المجاهدون الذين خرجوا لقتال العدو لإعلاء كلمة الله.\n" +
                "ابن السبيل: هو المسافر الذي اِنقطع عن بلده ونفذت نفقته."
    ),
)


val exploreData = listOf(
    ExploreData.Praying,
    ExploreData.Fasting,
    ExploreData.Zakah,
    ExploreData.Hajj


)